[
  {
    "title": "Neverkite migrantams iš Eppingo viešbučių ar butų, sako konservatoriai. \n\n(Or, slightly more natural sounding):\n\nKonservatoriai: migrantams iš Eppingo neverta skirti viešbučių ar butų.",
    "country": "England",
    "url": "naujienos/2025-08-20-eb7ca1.html",
    "lat": 52.5310214,
    "lng": -1.2649062
  },
  {
    "title": "Vidaus reikalų ministerija siekia apskųsti teismo sprendimą dėl viešbučio prieglobsčio prašytojams. \n\n**(Alternative, slightly more formal):**\n\nVidaus reikalų ministerija ketina apskųsti teismo sprendimą dėl prieglobsčio prašytojų apgyvendinimo viešbutyje.",
    "country": "United Kingdom",
    "url": "naujienos/2025-08-22-e4a86c.html",
    "lat": 54.7023545,
    "lng": -3.2765753
  },
  {
    "title": "Here are a few options for translating the headline into Lithuanian, depending on the nuance desired:\n\n**Option 1 (Most straightforward):**\n\nVidaus reikalų ministerija siekia apskųsti teismo sprendimą dėl priegločio prašytojų viešbučio.\n\n**Option 2 (More formal/legal sounding):**\n\nNamų biuras siekia apskųsti teismo sprendimą dėl priegločio viešbučio.\n\n**Option 3 (Focusing on the attempt to overturn):**\n\nVidaus reikalų ministerija bando apskųsti teismo sprendimą dėl priegločio prašytojų viešbučio.\n\n**Explanation of choices:**\n\n*   **\"Home Office\"** can be translated as \"Vidaus reikalų ministerija\" (Ministry of the Interior) or \"Namų biuras\" (literally \"Home Office,\" but less common in official Lithuanian). The first option might be better since Lithuanian doesn't really have a direct equivalent to \"Home Office\" with the same governmental scope.\n*   **\"seeks to appeal\"** is best translated as \"siekti apskųsti\" (to seek to appeal) or \"bando apskųsti\" (tries to appeal).\n*   **\"court ruling\"** translates to \"teismo sprendimas.\"\n*   **\"asylum hotel\"** translates to \"priegločio prašytojų viešbutis\" (hotel for asylum seekers) or simply \"priegločio viešbutis\" (asylum hotel).\n\n\n\nI recommend **Vidaus reikalų ministerija siekia apskųsti teismo sprendimą dėl priegločio prašytojų viešbučio.** as the most natural and accurate translation for a news headline.",
    "country": "United Kingdom",
    "url": "naujienos/2025-08-22-dc97a4.html",
    "lat": 54.7023545,
    "lng": -3.2765753
  },
  {
    "title": "Vidaus reikalų ministerija siekia apeliuoti prieš teismo sprendimą dėl viešbučio prieglobsčio prašytojams.",
    "country": "United Kingdom",
    "url": "naujienos/2025-08-22-112869.html",
    "lat": 54.7023545,
    "lng": -3.2765753
  },
  {
    "title": "Vidaus reikalų ministerija siekia apeliuoti prieš teismo sprendimą dėl viešbučio prieglobsčio prašytojams.",
    "country": "United Kingdom",
    "url": "naujienos/2025-08-22-112869.html",
    "lat": 54.7023545,
    "lng": -3.2765753
  }
]